---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.ElementRenamedOnPaste
source: html/f91a433b-d41a-92f5-1512-d10776211150.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.ElementRenamedOnPaste Property

The loaded type "[Name]" has been renamed to "[New Name]" to avoid conflicts with the existing type.

## Syntax (C#)
```csharp
public static FailureDefinitionId ElementRenamedOnPaste { get; }
```